{
  "timestamp": "2025-09-14T16:36:33.855369",
  "cache_key": "2ab0330672b61a1b07cb9d4fe21899ff",
  "metadata": {
    "keywords": "software engineer",
    "location": "india",
    "max_jobs": 10,
    "job_type_filter": null,
    "category_filter": null,
    "trusted_only": true,
    "scraped_at": "2025-09-14T16:36:33.855369"
  },
  "job_count": 10,
  "data": [
    {
      "title": "Software Engineer - Web",
      "company": "LinkedIn",
      "location": "Bengaluru, Karnataka, India",
      "description": "LinkedIn was built to help professionals achieve more in their careers, and everyday millions of people use our products to make connections, discover opportunities and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We are much more than a digital resume – we transform lives through innovative products and technology.Creating economic opportunity for every member of the global workforce is a responsibility we all share. To truly transform the global economy, we must evolve the way we hire and enable our talent to serve people of all backgrounds and experiences. LinkedIn is committed to diversity in its workforce and is proud to be an equal opportunity employer.This role will be based in Bangalore, India.At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.Responsibilities:- You will own the front-end development for one or more of our products and collaborate with visual/interaction designers, other engineers, and product managers to launch new products, iterate on existing features, and build a world-class user experience.- You will implement cutting-edge technologies and will be writing state-of-the-art code to keep LinkedIn at the cutting edge of current technology.- Your specific expertise will be required to make the site delightful, secure, performant and accessible to all our members.- You will meet with colleagues including product managers, designers and other engineers assigned to your project(s).Basic Qualifications:- Bachelor’s degree in Computer Science or related field- 2+ years of hands-on experience with semantic HTML, CSS and object-oriented JavaScript, jQueryPreferred Qualifications:- Extensive programming experience in modern JavaScript / TypeScript / similar languages; similar frameworks such as EmberJS / React- Experience developing multi-tier scalable and user-centric reliable applications that operate 24x7- Deep foundational knowledge of data structures and algorithms- Knowledge of UI and animation frameworks, touch user interface, and MVP application designSuggested Skills :- Javascript- HTML- CSSYou will Benefit from our Culture:We strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels.India Disability PolicyLinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. For more information on our equal opportunity policy, please visit https://legal.linkedin.com/content/dam/legal/Policy_India_EqualOppPWD_9-12-2023.pdfGlobal Data Privacy Notice for Job CandidatesThis document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal",
      "requirements": [
        "required to make the site delightful, secure, performant and accessible to all our members",
        "Bachelor’s degree in Computer Science or related field- 2+",
        "experience with semantic HTML, CSS and object-oriented JavaScript, jQueryPreferred Qualificatio",
        "knowledge of data structures and algorithms- Knowledge of UI and animation frameworks, touch",
        "Your specific expertise will be required to make the site delightful, secure, performant and accessible to all our members",
        "Bachelor’s degree in Computer Science or related field",
        "oriented JavaScript, jQueryPreferred Qualifications:"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Rust",
        "React",
        "Typescript",
        "Java",
        "Git",
        "Go",
        "Html",
        "Jquery",
        "Css",
        "Scala",
        "Ai"
      ],
      "posted_date": "2025-09-10",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-web-at-linkedin-4298604384?position=2&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=zSxpJrgnZ5ZrykYOq4CKWA%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Hyderabad, Telangana, India",
      "description": "Come work on a product that touches and transforms the lives of millions of families across the globe! Thrive in an innovative and startup-like environment putting your technical acumen and relentless customer obsession to the best use. In line with our CEO Satya’s mission for Microsoft to empower every person and every organization on the planet to achieve more, the mission of the Windows People eXperiences (WPX) team is to empower families to explore, learn and connect in a fun and safe environment. Families are among the most valuable and loyal customers of Microsoft. Our solutions elevate families at Microsoft! We ensure they get the best out of productivity in Microsoft 365, gaming in Xbox, browsing in Edge and a seamless experience across Windows, Xbox and other Devices. Powered by highly scalable Azure services, we transform personal data into personal value and empower modern  families to gain peace of mind, accomplish what matters most, and to ultimately allow them to focus on what’s most important: each other.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesBe deeply involved in Software Development, Testing, Integration, Deployment, Partner collaboration and Innovation aligned with product strategy. You will be hands on in building robust, high quality products using cutting edge technology.Hands on development for critical platform features in partnership with other ICs.Be a Subject Matter Expert in a specific domain or tech.Be customer and telemetry focused and reduce mean time to market and mean time to recover through Engineering Excellence.Play a significant role in driving culture of growth mindset.Drive Engineering Process Simplification through Tech Innovation.QualificationsRequired Qualifications: Bachelor's Degree in Computer Science, or related technical discipline with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or PythonOR equivalent experience.Deep technical experience.Researching (and perhaps building prototypes and beyond) some new ways of doing something.Demonstrates a mastery of communication and data presentation and storytelling skills.Exhibits a growth mindset and humility, while working through high stakes scenarios.Proven experiences as an ally who can further a more open, diverse, and inclusive workplace with a goal of everyone feeling like they belong.Demonstrated hypothesis-driven, problem-solving orientation.Strong design, coding, debugging, teamwork, and communication skills.Preferred Qualifications1+ years of overall experience shipping commercial software including 1+ years of experience in modern app development using XAML/UWP/WinUI and C/C++ is preferred.Excellent design, coding, debugging, teamwork, and communication skills.A Customer focused innovation mindset.Passionate about Craftmanship in engineering.Experience with cross group design and coordination is an advantage.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "Required Qualifications: Bachelor's Degree in Computer Science, or related technical discipline with proven e",
        "Bachelor's Degree in Computer Science, or related technica",
        "mastery of communication and data presentation and story",
        "Experience with cross group design and coordination is an advantage"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Ios",
        "Java",
        "Azure",
        "Go",
        "Python",
        "Express",
        "Less",
        "Scala",
        "Ai",
        "C++",
        "Aws"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4275652103?position=3&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=F969mKpCw6nL9PrzbBCe0g%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Bengaluru, Karnataka, India",
      "description": "The Linux Systems Group (LSG), part of Microsoft’s Core Operating Systems group, is central to powering Azure Cloud through Linux Operating Systems and virtualization technologies. The team is seeking a Software Engineer with strong programming skills who will closely work with senior engineers to develop, debug and maintain system-level software for a Linux-based platform. This is a great opportunity to join LSG and be part of Microsoft's Azure Cloud Infrastructure growth.ResponsibilitiesContribute to design, development and debugging of low-level system software components like bootloaders, system daemons and services and Kernel modules.Write clean, efficient, and well-documented code in C/C++, with occasional scripting in Python, Bash, and Makefiles.Analyze and comprehend existing systems and identify areas of improvement.Collaborate with cross-functional teams including hardware, firmware and application developers and ensure seamless integration.Collaborate with infrastructure, DevOps, and security teams to ensure seamless integration and deployment.Participate in code reviews, testing, and debugging sessions to ensure high-quality deliverables.Participate in debugging, profiling, and root cause analysis of system-level issues in production and staging environments.Assist in performance tuning, system bring-up, and troubleshooting on embedded or server-class Linux platforms.Contribute to Open Source Software (OSS) technologies.Contribute to automation of infrastructure components and CI/CD pipelines.QualificationsRequired Qualifications:Bachelor’s degree in Computer Science, or a related field.2+ years of experience with strong programming skills in C/C++, Python and a solid grasp of systems programming concepts.Familiarity with Linux internals, including process management, file systems, and networking.Basic understanding of kernel-space vs. user-space concepts.Experience with Git and standard development workflows.Ability to read and understand large, complex codebases and contribute meaningfully.Strong analytical, problem-solving and debugging skills.Preferred QualificationsExposure to Linux kernel development, device drivers, or embedded systems.Experience with cross-compilation, build systems (e.g., Make, CMake, Yocto), and debugging tools (e.g., GDB, strace, perf).Familiarity with hardware-software interfaces such as I2C, SPI, UART, or PCIe.Contributions to open-source projects or personal projects involving system-level programming.Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "Required Qualifications:Bachelor’s degree in Computer Science, or a related field",
        "Bachelor’s degree in Computer Science, or a related field",
        "experience with strong programming skills in C/C++, Python and a solid grasp of systems program",
        "Experience with Git and standard development workflows",
        "Experience with cross-compilation, build systems (e",
        "QualificationsRequired Qualifications:Bachelor’s degree in Computer Science, or a related field",
        "2+ years of experience with strong programming skills in C/C++, Python and a solid grasp of systems programming concepts",
        "Preferred QualificationsExposure to Linux kernel development, device drivers, or embedded systems"
      ],
      "job_type": "Full-time",
      "skills": [
        "Linux",
        "Ci/Cd",
        "Azure",
        "Git",
        "Python",
        "Express",
        "Less",
        "Ai",
        "C++",
        "Aws",
        "R"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4288964619?position=4&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=FMJpUDWVc4o2YYf65K6Bfg%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Hyderabad, Telangana, India",
      "description": "Microsoft is a company where passionate innovators come to collaborate, envision what can be and take their careers to levels they cannot achieve anywhere else. This is a world of more possibilities, more innovation, more openness in a cloud-enabled world.  The Business & Industry Copilots group is a rapidly growing organization that is responsible for the Microsoft Dynamics 365 suite of products, Power Apps, Power Automate, Dataverse, AI Builder, Microsoft Industry Solution and more. Microsoft is considered one of the leaders in Software as a Service in the world of business applications and this organization is at the heart of how business applications are designed and delivered. We are looking for a Software Engineer to join our team! Microsoft Copilot Studio is a critical and strategic product for Microsoft in the Copilot and Agentic AI era, empowering users to create, deploy, and manage AI-driven agents effortlessly. As a global, distributed Azure-based platform, we operate highly scalable, multi-tenant microservices to make agent building simple, impactful, and enterprise-ready.We are the Agent Lifecycle and Admin Experiences team at Microsoft Copilot Studio, based in IDC, where we focus on building seamless, secure, and scalable solutions that power the agent ecosystem. You will be a part of a team of engineers who thrive on solving complex problems at scale while doing it with impeccable quality.  You will play a crucial role in designing, developing and maintaining highly scalable, available, reliable, secure and efficient solutions that change the world of our customers.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond. ResponsibilitiesResponsibilities include:  Works with appropriate stakeholders to determine user requirements for a feature. Supports identification of dependencies, and the development of design documents for a product feature with oversight. With guidance, learns to create and implement code for a product, service, or feature reusing code as applicable. Communicate effectively and partner well with other disciplines and other teams to deliver high quality production code. Creates and implements code for a product, service, or feature, reusing code as applicable. Assists and learns about breaking down work items into tasks and provides estimation. Acts as a Designated Responsible Individual (DRI) in monitoring system/product feature/service for degradation, downtime, or interruptions for simple problems, and recommends actions to restore system/product/service by following the playbook. Reviews current developments and proactively seeks new knowledge that will improve the availability, reliability, efficiency, observability, and performance of products while also driving consistency in monitoring and operations at scale.QualificationsBachelor's Degree in Computer Science or related technical field AND 2+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR Master's Degree in Computer Science or related technical field AND 1+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python or equivalent experience. Other Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings: Microsoft Cloud Background Check:  This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.   Preferred/Additional QualificationsExcellent verbal, written, and cross-team collaboration skills. Passion for improving software quality and engineering excellence. A team player and collaborator, across time zones and diverse stakeholder groups. Passion for improving software quality and engineering excellence. Experience with building infrastructure using Microsoft Azure, AWS, or Google Cloud. #BICJobs #CopilotStudioMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "required for this role",
        "required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter",
        "Bachelor's Degree in Computer Science or related technical",
        "Master's Degree in Computer Science or related technical",
        "experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript",
        "Experience with building infrastructure using Microsoft Azure, AWS, or Google Cloud",
        "Other Requirements Ability to meet Microsoft, customer and/or government security screening requirements are required for this role",
        "Preferred/Additional QualificationsExcellent verbal, written, and cross"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Java",
        "Azure",
        "Go",
        "Python",
        "Express",
        "Less",
        "Scala",
        "Ai",
        "C++",
        "Aws",
        "R"
      ],
      "posted_date": "2025-09-05",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4296417197?position=6&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=7xG5p1xUm8r%2BUfuNXZDRmA%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Walmart Global Tech India",
      "location": "Bengaluru, Karnataka, India",
      "description": "Job Description Summary:Responsible for coding, unit testing, building high performance and scalable applications that meet the needs of millions of Walmart-International customers, in the areas of supply chain management & Customer experience.About Team: Our team collaborates with Walmart International, which has over 5,900 retail units operating outside of the United States under 55 banners in 26 countries including Africa, Argentina, Canada, Central America, Chile, China, India, Japan, and Mexico, to name a few.What you'll do:You are responsible for coding, unit testing, building high performance and scalable applications that meet the needs of millions of Walmart-International customers, in the areas of supply chain management & Customer experience.You are expected to be more intellectually curious engineer who is passionate about domain/technology in general. What you'll bring:Backend engineering platform development.Experience in Java technologies, Distributed systems and large-scale application development and design.Strong knowledge of and experience with Big Data technologies such as Hadoop, Spark, and KafkaHands on experience Kafka, Cassandra.Experience with a containerization technology and MicroserviceWell versed in CI/CDWork with Java, Multithreading, Data Structures, Algorithm, Design Patterns and develop robust high- performance and scalable applications.Extremely strong technical background with the capability of being hands-on and ability to mentor top individual technical talent.About Walmart Global Tech Imagine working in an environment where one line of code can make life easier for hundreds of millions of people. That’s what we do at Walmart Global Tech. We’re a team of software engineers, data scientists, cybersecurity expert's and service professionals within the world’s leading retailer who make an epic impact and are at the forefront of the next retail disruption. People are why we innovate, and people power our innovations. We are people-led and tech-empowered.We train our team in the skillsets of the future and bring in experts like you to help us grow. We have roles for those chasing their first opportunity as well as those looking for the opportunity that will define their career. Here, you can kickstart a great career in tech, gain new skills and experience for virtually every industry, or leverage your expertise to innovate at scale, impact millions and reimagine the future of retail.Flexible, hybrid work We use a hybrid way of working with primary in office presence coupled with an optimal mix of virtual presence. We use our campuses to collaborate and be together in person, as business needs require and for development and networking opportunities. This approach helps us make quicker decisions, remove location barriers across our global team, be more flexible in our personal lives.BenefitsBeyond our great compensation package, you can receive incentive awards for your performance. Other great perks include a host of best-in-class benefits maternity and parental leave, PTO, health benefits, and much more.BelongingWe aim to create a culture where every associate feels valued for who they are, rooted in respect for the individual. Our goal is to foster a sense of belonging, to create opportunities for all our associates, customers and suppliers, and to be a Walmart for everyone.At Walmart, our vision is \"everyone included.\" By fostering a workplace culture where everyone is—and feels—included, everyone wins. Our associates and customers reflect the makeup of all 19 countries where we operate. By making Walmart a welcoming place where all people feel like they belong, we’re able to engage associates, strengthen our business, improve our ability to serve customers, and support the communities where we operate.Equal Opportunity EmployerWalmart, Inc., is an Equal Opportunities Employer – By Choice. We believe we are best equipped to help our associates, customers and the communities we serve live better when we really know them. That means understanding, respecting and valuing unique styles, experiences, identities, ideas and opinions – while being inclusive of all people",
      "requirements": [
        "knowledge of and experience with Big Data technologies such as Hadoop, Spark, and KafkaHands",
        "Experience with a containerization technology and MicroserviceWell versed in CI/CDWork with Jav",
        "Strong knowledge of and experience with Big Data technologies such as Hadoop, Spark, and KafkaHa"
      ],
      "job_type": "Full-time",
      "skills": [
        "Ci/Cd",
        "Java",
        "Kafka",
        "Go",
        "Spark",
        "Hadoop",
        "Scala",
        "Ai",
        "Cassandra",
        "R"
      ],
      "posted_date": "2025-09-10",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-walmart-global-tech-india-4298326100?position=8&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=Jus3Vt1Wnlw%2BdCCOb8eOxQ%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Frontend Developer",
      "company": "Capgemini",
      "location": "Gurgaon, Haryana, India",
      "description": "At Capgemini Invent, we believe difference drives change. As inventive transformation consultants, we blend our strategic, creative and scientific capabilities, collaborating closely with clients to deliver cutting-edge solutions. Join us to drive transformation tailored to our client's challenges of today and tomorrow. Informed and validated by science and data. Superpowered by creativity and design. All underpinned by technology created with purpose.Your RoleA Frontend Engineer having expertise in React.js. Primary focus will be on developing user interface components and implementing them following well-known React.js workflows. Will ensure that these components and the overall application are secure, performant, robust and easy to maintain.Developing new user-facing features and maintaining existing features using React.js with Typescript and Redux / MobexBuilding reusable components and front-end libraries for future use.Translating designs and wireframes into high quality code. Develop UI components using ReactJS and Fluent UI.Work closely with backend and UX teams for seamless integration.Your ProfileSolid foundation in HTML, CSS, and JavaScriptStrong expertise in ReactJS and TypeScriptAzure UI Components, Fluent UIExperience with Azure DevOps and CI/CD pipelinesGood understanding of Web APIs and their integration with backend servicesWhat You Would Love About Working HereWe recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance.At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities.Equip yourself with valuable certifications in the latest technologies such as Generative AI.Capgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem.",
      "requirements": [
        "Experience with Azure DevOps and CI/CD pipelinesGood understanding of Web APIs and their integr",
        "Equip yourself with valuable certifications in the latest technologies such as Generative AI"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Rust",
        "React",
        "Typescript",
        "Java",
        "Azure",
        "Git",
        "Ci/Cd",
        "Go",
        "Html",
        "Css",
        "Less"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/frontend-developer-at-capgemini-4298726397?position=10&pageNum=0&refId=88ssnChpibL0rGCmh0C0MA%3D%3D&trackingId=3%2BRYSRvdVpEqOCyTU2f2zA%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Delhi, India",
      "description": "Have you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?If so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.As a SDET in the Azure Storage team, you will be involved in the testing and implementation of automated testing solutions for highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesWe are looking for engineers who are self-starters with a passion for learning and bringing fresh ideas to build high quality products. You will have opportunities to work on fast-paced teams and make high impact changes on a daily basis as you build world class services.Responsibilities IncludeDesign and develop comprehensive test strategies, automation frameworks, and methodologies to ensure software quality and reliability. Build benchmarking tools and frameworks to evaluate system performance under real-world workloads. Design and implement end-to-end scenarios, performance testing, profiling, and optimization strategies for storage systems. Analyze system bottlenecks, latency issues, and resource utilization across compute, storage, and networking layers. Investigate and resolve performance regressions, identifying root causes through deep dive debugging. Create, maintain, and execute test cases, scripts, and scenarios for diverse software components. Identify, document, and track defects, issues, and potential areas of improvement in the development process. Perform root cause analysis of complex issues and work with component teams to resolve them and improve product quality. Define and track key metrics to measure software quality and test effectiveness. QualificationsRequired/Minimum Qualifications (RQs/MQs)Bachelor's Degree in Computer Science, or related technical discipline AND 1+ Year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Excellence in software engineering practices. Knowledge of software QA methodologies, tools, and processes. Additional Or Preferred Qualifications (PQs)Bachelor's Degree in Computer Science OR related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Develop or specify standards, methods, or procedures to determine product quality or release readiness. Experience in building quality products and services preferably in distributed systems. #AzurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "Bachelor's Degree in Computer Science, or related technica",
        "Bachelor's Degree in Computer Science OR related technical",
        "Master's Degree in Computer Science or related technical",
        "experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript",
        "Knowledge of software QA methodologies, tools, and processes"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Ios",
        "Java",
        "Azure",
        "Go",
        "Python",
        "Express",
        "Scala",
        "Ai",
        "C++",
        "Aws",
        "R"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4300041421?position=1&pageNum=2&refId=b%2F8NgrCtgUvh8r%2FlP42DTg%3D%3D&trackingId=1Zr%2F11KsT3PX25R9y18%2Fig%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Telangana, India",
      "description": "Have you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?If so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.As a SDET in the Azure Storage team, you will be involved in the testing and implementation of automated testing solutions for highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesWe are looking for engineers who are self-starters with a passion for learning and bringing fresh ideas to build high quality products. You will have opportunities to work on fast-paced teams and make high impact changes on a daily basis as you build world class services.Responsibilities IncludeDesign and develop comprehensive test strategies, automation frameworks, and methodologies to ensure software quality and reliability. Build benchmarking tools and frameworks to evaluate system performance under real-world workloads. Design and implement end-to-end scenarios, performance testing, profiling, and optimization strategies for storage systems. Analyze system bottlenecks, latency issues, and resource utilization across compute, storage, and networking layers. Investigate and resolve performance regressions, identifying root causes through deep dive debugging. Create, maintain, and execute test cases, scripts, and scenarios for diverse software components. Identify, document, and track defects, issues, and potential areas of improvement in the development process. Perform root cause analysis of complex issues and work with component teams to resolve them and improve product quality. Define and track key metrics to measure software quality and test effectiveness. QualificationsRequired/Minimum Qualifications (RQs/MQs)Bachelor's Degree in Computer Science, or related technical discipline AND 1+ Year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Excellence in software engineering practices. Knowledge of software QA methodologies, tools, and processes. Additional Or Preferred Qualifications (PQs)Bachelor's Degree in Computer Science OR related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Develop or specify standards, methods, or procedures to determine product quality or release readiness. Experience in building quality products and services preferably in distributed systems. #AzurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "Bachelor's Degree in Computer Science, or related technica",
        "Bachelor's Degree in Computer Science OR related technical",
        "Master's Degree in Computer Science or related technical",
        "experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript",
        "Knowledge of software QA methodologies, tools, and processes"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Ios",
        "Java",
        "Azure",
        "Go",
        "Python",
        "Express",
        "Scala",
        "Ai",
        "C++",
        "Aws",
        "R"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4300042401?position=2&pageNum=2&refId=b%2F8NgrCtgUvh8r%2FlP42DTg%3D%3D&trackingId=MSX8KO56Qj5RnqiZ3bdvhg%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer",
      "company": "Microsoft",
      "location": "Maharashtra, India",
      "description": "Have you ever imagined a world with an infinite amount of storage available and accessible to everyone? A place where everyone in the world can easily access their data from anywhere at any time via any means (e.g., mobile phones, tablets, PCs, smart devices, etc.). Did you ever desire a universally accessible storage system to record all the knowledge known to mankind or to store all the data collected from all the scientists in the world for them to collaborate upon? Do you want to be part of a team that strives to bring these to reality?If so, the Microsoft Azure Storage team is what you are looking for. We are building Microsoft’s cloud storage solution - Microsoft Azure Storage, which is a massively scalable, highly distributed, ubiquitously accessible storage system, designed to scale out and serve the entire world. We continue to have tremendous hockey stick growth, we have many Exabyte’s of data stored, and are designing and building systems for Zettabyte scale to support demand growth for the coming years.As a SDET in the Azure Storage team, you will be involved in the testing and implementation of automated testing solutions for highly scalable, performant services that deliver highly reliable, secure and available access to storage for our customers. You will face challenges of monitoring, analyzing, and designing for ever-growing data needs of our customers and for ensuring data privacy, protection and compliance. This opportunity will allow you to develop your technical skills in cloud services and storage, accelerate career growth, and provide an opportunity to work in a highly dynamic, flexible, and globally distributed team.Microsoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.ResponsibilitiesWe are looking for engineers who are self-starters with a passion for learning and bringing fresh ideas to build high quality products. You will have opportunities to work on fast-paced teams and make high impact changes on a daily basis as you build world class services.Responsibilities IncludeDesign and develop comprehensive test strategies, automation frameworks, and methodologies to ensure software quality and reliability. Build benchmarking tools and frameworks to evaluate system performance under real-world workloads. Design and implement end-to-end scenarios, performance testing, profiling, and optimization strategies for storage systems. Analyze system bottlenecks, latency issues, and resource utilization across compute, storage, and networking layers. Investigate and resolve performance regressions, identifying root causes through deep dive debugging. Create, maintain, and execute test cases, scripts, and scenarios for diverse software components. Identify, document, and track defects, issues, and potential areas of improvement in the development process. Perform root cause analysis of complex issues and work with component teams to resolve them and improve product quality. Define and track key metrics to measure software quality and test effectiveness. QualificationsRequired/Minimum Qualifications (RQs/MQs)Bachelor's Degree in Computer Science, or related technical discipline AND 1+ Year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Excellence in software engineering practices. Knowledge of software QA methodologies, tools, and processes. Additional Or Preferred Qualifications (PQs)Bachelor's Degree in Computer Science OR related technical field AND 2+ year(s) technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, OR Python OR Master's Degree in Computer Science or related technical field with proven experience coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python OR equivalent experience. Develop or specify standards, methods, or procedures to determine product quality or release readiness. Experience in building quality products and services preferably in distributed systems. #AzurecorejobsMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
      "requirements": [
        "Bachelor's Degree in Computer Science, or related technica",
        "Bachelor's Degree in Computer Science OR related technical",
        "Master's Degree in Computer Science or related technical",
        "experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript",
        "Knowledge of software QA methodologies, tools, and processes"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Ios",
        "Java",
        "Azure",
        "Go",
        "Python",
        "Express",
        "Scala",
        "Ai",
        "C++",
        "Aws",
        "R"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-at-microsoft-4300039563?position=3&pageNum=2&refId=b%2F8NgrCtgUvh8r%2FlP42DTg%3D%3D&trackingId=uGDYUpQ%2FJfW%2BSsaKNEC%2FaQ%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer II, Full Stack, Google Cloud",
      "company": "Google",
      "location": "Bengaluru, Karnataka, India",
      "description": "Minimum qualifications:Bachelor’s degree or equivalent practical experience. 1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, Javascript).1 year of experience with data structures or algorithms.Preferred qualifications:Master's degree or PhD in Computer Science or related technical field.Experience developing accessible technologies.1 year of experience with full stack development, across back-end such as Java, Python, GO, or C++ codebases, and front-end experience including JavaScript or TypeScript, HTML, CSS, etc.About The JobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.Google Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.ResponsibilitiesWrite product or system development code.Participate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.Review code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
      "requirements": [
        "Bachelor’s degree or equivalent practical experience",
        "Master's degree or PhD in Computer Science or related te",
        "experience with software development in one or more programming languages (e",
        "experience with data structures or algorithms",
        "experience with full stack development, across back-end such as Java, Python, GO, or C++ codeba",
        "Minimum qualifications:Bachelor’s degree or equivalent practical experience",
        "Preferred qualifications:Master's degree or PhD in Computer Science or related technical field"
      ],
      "job_type": "Full-time",
      "skills": [
        "Javascript",
        "Rust",
        "Typescript",
        "Java",
        "Git",
        "Go",
        "Python",
        "Html",
        "Css",
        "Less",
        "C++",
        "Ai"
      ],
      "posted_date": "2025-09-05",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-ii-full-stack-google-cloud-at-google-4286416745?position=6&pageNum=2&refId=b%2F8NgrCtgUvh8r%2FlP42DTg%3D%3D&trackingId=poYUjdZ9Ufwmcg5bycx6qg%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    }
  ]
}