{
  "timestamp": "2025-09-14T16:54:49.353839",
  "cache_key": "b7139f4d52851a93d433ff7a44f38533",
  "metadata": {
    "keywords": "Data Scientist",
    "location": "india",
    "max_jobs": 25,
    "job_type_filter": null,
    "category_filter": null,
    "trusted_only": true,
    "scraped_at": "2025-09-14T16:54:49.353839"
  },
  "job_count": 25,
  "data": [
    {
      "title": "Data Scientist- Across PAN India",
      "company": "Capgemini Engineering",
      "location": "Bengaluru, Karnataka, India",
      "description": "Position Title: Data ScientistCompany Overview: Capgemini Engineering is a global leader in engineering services, bringing together a worldwide team of engineers, scientists, and architects to assist the most innovative companies in unleashing their potential.Position Overview: We are seeking a skilled Data Scientist with expertise in Cognite Data Fusion, data modelling, Unified Namespace (UNS), ontologies, and the identification of data products and datasets. The ideal candidate will have a strong background in developing and implementing data science projects, analyzing large and complex data sets, and driving data-driven decision-making across the organizationKey Responsibilities:Solution Development: Design, implement, and deploy scalable data solutions utilizing Cognite Data Fusion, focusing on data modeling, UNS, and ontologies to address industry-specific challenges.​Data Analysis: Analyze large and complex data sets to identify trends, insights, and opportunities, supporting solution development and business strategies.​Collaboration: Collaborate with cross-functional teams to understand data needs and translate them into data science solutions, ensuring seamless integration and operationalization of digital solutions across various domains.Client Engagement: Engage with clients to understand their business objectives, lead discovery workshops, and provide expert guidance on data-driven strategies and potential challenges.​Visualization: Develop dashboards and visualizations using tools such as Power BI, Grafana, or web development frameworks like Plotly Dash and Streamlit to effectively communicate data insights.​Mentorship: Provide guidance and mentorship to junior team members, promoting best practices in data science and software development.​Qualifications:Educational Background: Master’s or PhD degree in a quantitative field.​Experience: Minimum of 2 years of experience in data science, with a strong background in developing analytical solutions within domains such as pharma, oil and gas, manufacturing, or power & utilities.​Technical Skills: Proficiency in Python and its data ecosystem (pandas, numpy), machine learning libraries (scikit-learn, keras), and experience with SQL.​Visualization Tools: Experience with data visualization tools like Power BI, Grafana, Tableau, or web development frameworks such as Plotly Dash and Streamlit.​Software Practices: Strong understanding of software development practices, including version control (e.g., Git), automated testing, and documentation.​Cloud Platforms: Experience with cloud services such as GCP, Azure, or AWS is advantageous.​Domain Knowledge: Familiarity with industrial data management concepts, including Unified Namespace (UNS), ontologies, and data product identification.​Communication Skills: Excellent communication and collaboration skills, with the ability to work with cross-functional teams and stakeholders.​Leadership: Demonstrated ability to lead projects and mentor junior team members.​Preferred Qualifications:Industry Expertise: Experience serving as a domain expert on internal or customer projects within relevant industries.​Cloud Deployment: Experience deploying models and solutions in production environments using cloud infrastructure.​Continuous Learning: Willingness to stay updated with the latest developments in data science and related technologies.​",
      "requirements": [
        "Master’s or PhD degree in a quantitative field",
        "Proficiency in Python and its data ecosystem (pandas, numpy), machine learning libraries (scik",
        "Experience with data visualization tools like Power BI, Grafana, Tableau, or web development fr",
        "Experience with cloud services such as GCP, Azure, or AWS is advantageous",
        "Strong understanding of software development practices, including version control (e",
        "​Qualifications:Educational Background: Master’s or PhD degree in a quantitative field",
        "​Preferred Qualifications:Industry Expertise: Experience serving as a domain expert on internal or customer projects within relevant industries"
      ],
      "job_type": "Full-time",
      "skills": [
        "Less",
        "Ai",
        "Aws",
        "Keras",
        "Scikit-Learn",
        "Power Bi",
        "Scala",
        "Tableau",
        "Sql",
        "Pandas",
        "Machine Learning",
        "Numpy"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-across-pan-india-at-capgemini-engineering-4296207682?position=2&pageNum=0&refId=nn4%2BOm9pFwSrrrq7kcNLiA%3D%3D&trackingId=m0gZWXja5aLcOXoDMOv1Gg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data scientist- Python- AI/ML GEN AI- Across india",
      "company": "Capgemini Engineering",
      "location": "Mumbai, Maharashtra, India",
      "description": "• Develop strategies/solutions to solve problems in logical yet creative ways, leveraging state-of-the-art machine learning, deep learning and GEN AI techniques.• Technically lead a team of data scientists to produce project deliverables on time and with high quality.• Identify and address client needs in different domains, by analyzing large and complex data sets, processing, cleansing, and verifying the integrity of data, and performing exploratory data analysis (EDA) using state-of-the-art methods.• Select features, build and optimize classifiers/regressors, etc. using machine learning and deep learning techniques.• Enhance data collection procedures to include information that is relevant for building analytical systems, and ensure data quality and accuracy.• Perform ad-hoc analysis and present results in a clear manner to both technical and non-technical stakeholders.• Create custom reports and presentations with strong data visualization and storytelling skills to effectively communicate analytical conclusions to senior officials in a company and other stakeholders.• Expertise in data mining, EDA, feature selection, model building, and optimization using machine learning and deep learning techniques.• Strong programming skills in Python.• Excellent communication and interpersonal skills, with the ability to present complex analytical concepts to both technical and non-technical stakeholders.Primary Skills :- Excellent understanding and hand-on experience of data-science and machine learning techniques & algorithms for supervised & unsupervised problems, NLP and computer vision and GEN AI. Good applied statistics skills, such as distributions, statistical inference & testing, etc.- Excellent understanding and hand-on experience on building Deep-learning models for text & image analytics (such as ANNs, CNNs, LSTM, Transfer Learning, Encoder and decoder, etc).- Proficient in coding in common data science language & tools such as R, Python.- Experience with common data science toolkits, such as NumPy, Pandas, Matplotlib, StatsModel, Scikitlearn, SciPy, NLTK, Spacy, OpenCV etc.- Experience with common data science frameworks such as Tensorflow, Keras, PyTorch, XGBoost,etc.- Exposure or knowledge in cloud (Azure/AWS).- Experience on deployment of model in production.",
      "requirements": [
        "Experience with common data science toolkits, such as NumPy, Pandas, Matplotlib, StatsModel, Sc",
        "Experience with common data science frameworks such as Tensorflow, Keras, PyTorch, XGBoost,etc",
        "Excellent understanding and hand-on experience of data-science and machine learning techniques & algori",
        "Excellent understanding and hand-on experience on building Deep-learning models for text & image analyt"
      ],
      "job_type": "Full-time",
      "skills": [
        "Keras",
        "Aws",
        "Go",
        "Deep Learning",
        "Pandas",
        "Machine Learning",
        "Pytorch",
        "Numpy",
        "R",
        "Data Science",
        "Ai",
        "Azure"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-python-ai-ml-gen-ai-across-india-at-capgemini-engineering-4295891624?position=3&pageNum=0&refId=nn4%2BOm9pFwSrrrq7kcNLiA%3D%3D&trackingId=qAiAcRJ31I4yNyIsfdvRmw%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Senior - Python AI/ML",
      "company": "KPMG India",
      "location": "Gurgaon, Haryana, India",
      "description": "Job DescriptionAbout KPMG in India KPMG entities in India are professional services firm(s). These Indian member firms are affiliated with KPMG International Limited. KPMG was established in India in August 1993. Our professionals leverage the global network of firms, and are conversant with local laws, regulations, markets and competition. KPMG has offices across India in Ahmedabad, Bengaluru, Chandigarh, Chennai, Gurugram, Jaipur, Hyderabad, Jaipur, Kochi, Kolkata, Mumbai, Noida, Pune, Vadodara and Vijayawada. KPMG entities in India offer services to national and international clients in India across sectors. We strive to provide rapid, performance-based, industry-focused and technology-enabled services, which reflect a shared knowledge of global and local industries and our experience of the Indian business environment.Python AI/MLEqual employment opportunity informationKPMG India has a policy of providing equal opportunity for all applicants and employees regardless of their color, caste, religion, age, sex/gender, national origin, citizenship, sexual orientation, gender identity or expression, disability or other legally protected status. KPMG India values diversity and we request you to submit the details below to support us in our endeavor for diversity. Providing the below information is voluntary and refusal to submit such information will not be prejudicial to you. QualificationsB.E/B.Tech/Post Graduation",
      "requirements": [
        "knowledge of global and local industries and our experience of the Indian business environme"
      ],
      "job_type": "Full-time",
      "skills": [
        "Less",
        "Aws",
        "Express",
        "R",
        "Ai",
        "Python"
      ],
      "posted_date": "2025-09-06",
      "job_url": "https://in.linkedin.com/jobs/view/senior-python-ai-ml-at-kpmg-india-4296942293?position=4&pageNum=0&refId=nn4%2BOm9pFwSrrrq7kcNLiA%3D%3D&trackingId=mK1flsVsb7lsmNMQdfRMBQ%3D%3D",
      "salary": "",
      "category": "Other",
      "is_trusted_company": true,
      "experience_level": "Senior",
      "employment_type": "Full-time"
    },
    {
      "title": "Software Engineer, Machine Learning",
      "company": "LinkedIn",
      "location": "Bengaluru, Karnataka, India",
      "description": "LinkedIn was built to help professionals achieve more in their careers, and every day millions of people use our products to make connections, discover opportunities, and gain insights. Our global reach means we get to make a direct impact on the world’s workforce in ways no other company can. We’re much more than a digital resume -- we transform lives through innovative products and technology.Every day, millions of posts, videos, and articles course through the LinkedIn feed, generating tens of thousands of comments every hour — and tens of millions more shares and likes.Join the LSS-AI team and help create meaningful impact by connecting sellers and buyers to mutual growth opportunities! LinkedIn Sales Solutions (LSS) is one of the fastest-growing multi-billion dollar verticals at LinkedIn, and the LSS-AI team is at the forefront of building the next generation of AI-centric Sales Navigator platform. This platform enables tens of millions of companies to connect with their future customers, driving significant economic value. As a member of the LSS-AI team, you will work on cutting-edge projects, including building Agentic and GenAI-powered search and recommendation systems, tuning and applying domain-specific LLMs, and collaborating with our partner vendors like OpenAI. You will have the opportunity to work with passionate AI engineers, as well as our brilliant cross-functional partner teams in Engineering, Product Management, and Design. Together, we are creating immense economic value for our customers using the largest global professional economic graph.As part of a new and fast growing team of top-notch scientists and engineers, you will experience all the excitement and dynamism of a startup along with the scale and technology of a world-class enterprise.At LinkedIn, our approach to flexible work is centered on trust and optimized for culture, connection, clarity, and the evolving needs of our business. The work location of this role is hybrid, meaning it will be performed both from home and from a LinkedIn office on select days, as determined by the business needs of the team.Responsibilities:- Develop advanced embedding models (text, graph, structured data) to capture semantic meaning of companies, people, and signals for retrieval and ranking.- Design and train ranking models that optimize search relevance, entity discovery, and lead recommendations across millions of entities.- Build large-scale classification models to automatically tag industries, technologies, buyer intent, and other business signals.- Deploy and monitor production ML pipelines for embedding generation, model inference, and continuous retraining with real-world feedback loops. - Develop state-of-the-art supervised and semi-supervised models that scale to hundreds of millions of companies, professionals, and business signals.- Own end-to-end model development and deployment of embeddings, retrieval, ranking, and classification models in large-scale production environments.- Mentor junior ML engineers in applying advanced machine learning techniques to core problems such as entity resolution, lead scoring, and search relevance.- Represent LinkedIn in academic and industry circles by showcasing our innovation, data products and scientific expertise in bringing game-changing data products to marketBasic Qualifications:- Bachelor’s degree or related practical experience - 2+ years of experience in at least one of the following areas: Recommendation systems, Machine Learning, Statistical modeling/inference, Data mining, Graph/geometric deep learning, Large Language Models, Generative AI, Distributed Training. Preferred Qualifications:- Master’s degree in computer science, statistics, engineering, mathematics, or similar quantitative discipline.- 3+ years of hands-on experience working on Recommendation systems, Machine Learning, Statistical modeling/inference, Data mining, Graph/geometric deep learning, Large Language Models, Generative AI, Distributed Training. - Understanding of standard programming and software engineering practices- Proven track record of publishing at academic and industry venues- Ability and eagerness to programSuggested Skills:- Machine Learning- Generative-AI- Large Language ModelsYou will Benefit from our Culture:We strongly believe in the well-being of our employees and their families. That is why we offer generous health and wellness programs and time away for employees of all levels.India Disability PolicyLinkedIn is an equal employment opportunity employer offering opportunities to all job seekers, including individuals with disabilities. For more information on our equal opportunity policy, please visit https://legal.linkedin.com/content/dam/legal/Policy_India_EqualOppPWD_9-12-2023.pdfGlobal Data Privacy Notice for Job CandidatesThis document provides transparency around the way in which LinkedIn handles personal data of employees and job applicants: https://legal.linkedin.com/candidate-portal",
      "requirements": [
        "Bachelor’s degree or related practical experience - 2+ yea",
        "Master’s degree in computer science, statistics, enginee",
        "Bachelor’s degree or related practical experience",
        "Preferred Qualifications:",
        "Master’s degree in computer science, statistics, engineering, mathematics, or similar quantitative discipline"
      ],
      "job_type": "Full-time",
      "skills": [
        "Deep Learning",
        "Machine Learning",
        "R",
        "Rust",
        "Ai",
        "Git"
      ],
      "posted_date": "2025-09-10",
      "job_url": "https://in.linkedin.com/jobs/view/software-engineer-machine-learning-at-linkedin-4298312276?position=8&pageNum=0&refId=nn4%2BOm9pFwSrrrq7kcNLiA%3D%3D&trackingId=WImfp3jp3i%2BFofY7pveA5g%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI/ML",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "3+ years in MLOps or related roles - Data Science - Hands-on experience with ML model deployment and monitoring - System Administration - Proven track record of implementing CI/CD pipelines - Automation Tools - Experience with version control systems (Git).Assess the complete ML development process. - Data Engineering - Evaluate the maturity level of ML systems. - Software Development - Provide recommendations for improvement - DevOps - Implement and maintain CI/CD pipelines for ML models. - Monitor and manage model performance in production.",
      "requirements": [
        "experience with ML model deployment and monitoring - System Administration - Proven track recor",
        "Experience with version control systems (Git)"
      ],
      "job_type": "Full-time",
      "skills": [
        "Ci/Cd",
        "R",
        "Data Science",
        "Ai",
        "Git"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-at-infosys-4299889391?position=9&pageNum=0&refId=nn4%2BOm9pFwSrrrq7kcNLiA%3D%3D&trackingId=WP3TTnJ%2FufQbTFfOBKpY%2BQ%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Python developer",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Primary skills:Technology->Machine Learning->PythonA day in the life of an Infoscion As part of the Infosys delivery team, your primary role would be to ensure effective Design, Development, Validation and Support activities, to assure that our clients are satisfied with the high levels of service in the technology domain. You will gather the requirements and specifications to understand the client requirements in a detailed manner and translate the same into system requirements. You will play a key role in the overall estimation of work requirements to provide the right information on project estimations to Technology Leads and Project Managers. You would be a key contributor to building efficient programs/ systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Knowledge of design principles and fundamentals of architecture Understanding of performance engineering Knowledge of quality processes and estimation techniques Basic understanding of project domain Ability to translate functional / nonfunctional requirements to systems requirements Ability to design and code complex programs Ability to write test cases and scenarios based on the specifications Good understanding of SDLC and agile methodologies Awareness of latest technologies and trends Logical thinking and problem solving skills along with an ability to collaborate",
      "requirements": [
        "Knowledge of design principles and fundamentals of architecture Understanding of performance",
        "Knowledge of quality processes and estimation techniques Basic understanding of project doma"
      ],
      "job_type": "Full-time",
      "skills": [
        "Go",
        "Machine Learning",
        "Ios",
        "R",
        "Ai",
        "Git",
        "Python"
      ],
      "posted_date": "2025-09-10",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4298380817?position=4&pageNum=2&refId=19w4lZ3ZWnxEeNqx0475xA%3D%3D&trackingId=NMlqb9aJnRkLA2mehAIGAg%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Machine learning NLP",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Engage with Business / Stakeholders with status update on progress of development and issue fix Setup Standards related to Coding, Pipelines and Documentation Understand the requirements from the business and translate it into an appropriate technical requirement. Define key business problems to be solved; formulate high level solution approaches and identify data to solve those problems, develop, analyze/draw conclusions and present to client. Engage with Business / Stakeholders with status update on progress of development and issue fixAbout Us Infosys is a global leader in next-generation digital services and consulting. We enable clients in more than 50 countries to navigate their digital transformation. With over four decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem. Infosys provides equal employment opportunities to applicants and employees without regard to race; color; sex; gender identity; sexual orientation; religious practices and observances; national origin; pregnancy, childbirth, or related medical conditions; status as a protected veteran or spouse/family member of a protected veteran; or disability.",
      "requirements": [],
      "job_type": "Full-time",
      "skills": [
        "Ai",
        "Git",
        "R"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/machine-learning-nlp-at-infosys-4298948766?position=10&pageNum=2&refId=19w4lZ3ZWnxEeNqx0475xA%3D%3D&trackingId=VOkbxdjMfRMzFK3CR0pNqw%3D%3D",
      "salary": "",
      "category": "Other",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Python Developer",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Programming: Python advance (Framework: Django) Angular or ReactJS desirable Exposure to RDBMS & NoSQL DB's Cloud Knowledge will be plus AI Skills: (Will be plus) PyTorch or TensorFlow Deep Learning (Neural Networks) Knowledge NLP – TransformersShould have experience to build best-fit architectural solution in form of frameworks/ tools in identified technology area Should be conversant with architecture principles and practices ( Architecture frameworks and methodology, Architecture patterns, Architect QoS ( performance, scalability, maintainability, reusability) Should be able to provide technical leadership and strategic direction for testing Should be able to create technology differentiation by contribution to new proposal/ pursuits Preferably should be aware of industry trends in some emerging technology areas (blockchain, AR-VR, LCNC, Quantum computing etc) Preferably a thought leaders within the area of technology specialization, esp for Sr. Tech Arch role (should have published some whitepapers or presented in some industry forums)",
      "requirements": [],
      "job_type": "Full-time",
      "skills": [
        "Angular",
        "Tensorflow",
        "Django",
        "Scala",
        "Go",
        "Deep Learning",
        "Sql",
        "Pytorch",
        "R",
        "Ai",
        "Python",
        "React"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4299631491?position=6&pageNum=5&refId=KqWCC7fMXDhTd477O284CA%3D%3D&trackingId=tvduLi4tU5%2BHNKTkweTs2A%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Python Developer",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Primary skills:Technology->Machine Learning->Python Desirables:Technology->OpenSystem->Python - OpenSystem Knowledge with Generative AI/ Machine Learning/ Deep Learning will be an added advantage.A day in the life of an Infoscion As part of the Infosys Delivery team, you will work on implementing designs, developing high quality programs and systems, partnering with our clients to ensure high quality deliverables. You will create technical artifacts and be the first point of contact in responding to production issues and conducting any technical analysis to arrive at solutions You will share your learnings from projects through knowledge management initiatives and leverage knowledge from other projects to drive high efficiency and effectiveness You will be a key contributor to building efficient programs/systems and if you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! If you think you fit right in to help our clients navigate their next in their digital transformation journey, this is the place for you! Advanced conceptual understanding of at least one Programming Language Advanced conceptual understanding of one database and one Operating System Understanding of Software Engineering with practice in at least one project Ability to contribute in medium to complex tasks independently Exposure to Design Principles and ability to understand Design Specifications independently Ability to run Test Cases and scenarios as per the plan Ability to accept and respond to production issues and coordinate with stake holders Good understanding of SDLC Analytical abilities Logical thinking Awareness of latest technologies and trends",
      "requirements": [],
      "job_type": "Full-time",
      "skills": [
        "Go",
        "Deep Learning",
        "Machine Learning",
        "Ios",
        "R",
        "Ai",
        "Git",
        "Python"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/python-developer-at-infosys-4299666839?position=7&pageNum=5&refId=KqWCC7fMXDhTd477O284CA%3D%3D&trackingId=s57zUH5VwUHOSzfsk1NgBw%3D%3D",
      "salary": "",
      "category": "Software Engineering",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Sn. Data Scientists- AI/ML- GEN AI- Work location :  Across india | EXP: 4 - 12 years",
      "company": "Capgemini Engineering",
      "location": "Bengaluru, Karnataka, India",
      "description": "Data Scientists- AI/ML- GEN AI- Across india | EXP: 4 - 10 years data scientists with total of around 4-10 years of experience and atleast 4-10 years of relevant data science, analytics, and AI/ML Python; data science; AI/ML; GEN AIPrimary Skills :- Excellent understanding and hand-on experience of data-science and machine learning techniques & algorithms for supervised & unsupervised problems, NLP and computer vision and GEN AI. Good applied statistics skills, such as distributions, statistical inference & testing, etc.- Excellent understanding and hand-on experience on building Deep-learning models for text & image analytics (such as ANNs, CNNs, LSTM, Transfer Learning, Encoder and decoder, etc).- Proficient in coding in common data science language & tools such as R, Python.- Experience with common data science toolkits, such as NumPy, Pandas, Matplotlib, StatsModel, Scikitlearn, SciPy, NLTK, Spacy, OpenCV etc.- Experience with common data science frameworks such as Tensorflow, Keras, PyTorch, XGBoost,etc.- Exposure or knowledge in cloud (Azure/AWS).- Experience on deployment of model in production.",
      "requirements": [
        "Experience with common data science toolkits, such as NumPy, Pandas, Matplotlib, StatsModel, Sc",
        "Experience with common data science frameworks such as Tensorflow, Keras, PyTorch, XGBoost,etc",
        "Excellent understanding and hand-on experience of data-science and machine learning techniques & algori",
        "Excellent understanding and hand-on experience on building Deep-learning models for text & image analyt",
        "10 years of experience and atleast 4"
      ],
      "job_type": "Full-time",
      "skills": [
        "Keras",
        "Aws",
        "Go",
        "Pandas",
        "Machine Learning",
        "Pytorch",
        "Numpy",
        "R",
        "Data Science",
        "Ai",
        "Azure",
        "Python"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/sn-data-scientists-ai-ml-gen-ai-work-location-across-india-exp-4-12-years-at-capgemini-engineering-4295898476?position=9&pageNum=5&refId=KqWCC7fMXDhTd477O284CA%3D%3D&trackingId=PojmkeFmytwX32wBEUr6dg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Machine Learning Engineer",
      "company": "Intellias",
      "location": "Pune, Maharashtra, India",
      "description": "Project overviewAre you a skilled Machine Learning engineer with a passion for Computer vision, NLP or Generative AI? Do you have a knack for understanding both the technical intricacies and the business implications of data-driven solutions? If so, we have an exciting opportunity for you to join our team as machine Learning EngineerRequirementsStrong experience in Computer Vision, NLP, Generative AI demonstrated through relevant projects or research.Proficiency in programming languages such as Python and libraries/frameworks like TensorFlow, PyTorch, OpenCV, spaCy, etc. and cloud AI services Aws/Azure/GCPProven ability to bridge the gap between technical concepts and business impact, with a clear understanding of how data science aligns with business goals.Excellent communication skills to effectively convey complex technical concepts to both technical and non-technical stakeholders.Nice to haveGCP Professional Machine Learning Engineer certification (not older than a year)Master's or Ph.D. in Computer Science, Data Science, Machine Learning, or a related fieldResponsibilitiesDrive/Participate the ideation, development, and execution of POCs and AI related projectDevelop and implement machine learning models, algorithms, and data-driven solutions to address complex business problemsCollaborate cross-functionally with engineering, product management, and other relevant teams to integrate data-driven functionalities into our products.",
      "requirements": [
        "Proficiency in programming languages such as Python and libraries/frameworks like TensorFlow,",
        "Strong experience in Computer Vision, NLP, Generative AI demonstrated through relevant projects o",
        "Nice to haveGCP Professional Machine Learning Engineer certification (not older than a year)Master's or Ph"
      ],
      "job_type": "Full-time",
      "skills": [
        "Ai",
        "Aws",
        "Go",
        "Machine Learning",
        "Pytorch",
        "R",
        "Data Science",
        "Gcp",
        "Azure",
        "Python",
        "Tensorflow"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-intellias-4299774921?position=10&pageNum=5&refId=KqWCC7fMXDhTd477O284CA%3D%3D&trackingId=0XVt0uuy3SISZrAVyPcQXw%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI / ML Engineer",
      "company": "Accenture services Pvt Ltd",
      "location": "Bengaluru, Karnataka, India",
      "description": "Project Role : AI / ML EngineerProject Role Description : Develops applications and systems that utilize AI tools, Cloud AI services, with proper cloud or on-prem application pipeline with production ready quality. Be able to apply GenAI models as part of the solution. Could also include but not limited to deep learning, neural networks, chatbots, image processing.Must have skills : Generative AIGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an AI / ML Engineer, you will engage in the development of applications and systems that leverage artificial intelligence tools and cloud AI services. Your typical day will involve designing and implementing production-ready solutions, ensuring that they meet quality standards. You will work with various AI models, including generative AI, deep learning, and neural networks, while also exploring innovative applications such as chatbots and image processing. Collaboration with cross-functional teams will be essential to integrate these advanced technologies into effective solutions that address real-world challenges. Roles & Responsibilities: - Expected to be an SME. - Collaborate and manage the team to perform. - Responsible for team decisions. - Engage with multiple teams and contribute on key decisions. - Provide solutions to problems for their immediate team and across multiple teams. - Mentor junior team members to enhance their skills and knowledge. - Continuously evaluate and improve existing processes and workflows to increase efficiency. Professional & Technical Skills: - Must To Have Skills: Proficiency in Generative AI. - Strong understanding of deep learning frameworks such as TensorFlow or PyTorch. - Experience with cloud platforms like AWS, Azure, or Google Cloud for deploying AI solutions. - Familiarity with data preprocessing and augmentation techniques for training AI models. - Knowledge of software development best practices, including version control and testing methodologies. Additional Information: - The candidate should have minimum 5 years of experience in Generative AI. - This position is based at our Bengaluru office. - A 15 years full time education is required.",
      "requirements": [
        "Must have skills : Generative AIGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducational",
        "essential to integrate these advanced technologies into effective solutions that address real-world challenges",
        "minimum 5 years of experience",
        "Proficiency in Generative AI",
        "Experience with cloud platforms like AWS, Azure, or Google Cloud for deploying AI solutions",
        "Knowledge of software development best practices, including version control and testing meth",
        "Strong understanding of deep learning frameworks such as TensorFlow or PyTorch",
        "functional teams will be essential to integrate these advanced technologies into effective solutions that address real"
      ],
      "job_type": "Full-time",
      "skills": [
        "Aws",
        "Artificial Intelligence",
        "Go",
        "Deep Learning",
        "Pytorch",
        "R",
        "Ai",
        "Azure",
        "Tensorflow"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-accenture-services-pvt-ltd-4299865688?position=4&pageNum=7&refId=HDSHoPm%2Bx%2BufnSMxJeqFEA%3D%3D&trackingId=a53VHgL4LqWuPiSrtbJKnw%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data Scientist Manager, Product, Photos and G1",
      "company": "Google",
      "location": "Bengaluru, Karnataka, India",
      "description": "Minimum qualifications:Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.10 years of experience using analytics to solve product or business problems, performing statistical analysis, and coding (e.g., Python, R, SQL), or 8 years of experience with a Master's degree.3 years of experience as a people manager within a technical leadership role.Preferred qualifications:Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.12 years of experience using analytics to solve product or business problems, performing statistical analysis, and coding (e.g., Python, R, SQL).4 years of experience as a people manager within a technical leadership role.Ability to identify business problems and come up with solutions to solve the problem.Ability to lead and grow a team of data scientists through both technical leadership and people management skills.Excellent problem-solving, analysis skills and business judgment.About The JobTo empower Photos+G1's organizational mission, our team made up of Data Engineering, Data Science, and Product Operations/Strategy all work closely together towards the mission to understand our users to drive product change. The close collaboration between our complementary technical and strategic skills is our reason for success and allows us to set and accomplish an exciting agenda spanning analytical tools, insights, and product strategies.Google Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.ResponsibilitiesPartner closely with Finance, UX, Product Management, and Engineering teams to deliver analytics/experimentation infrastructure and processes that empower the team to deliver insights and decision-making at scale.Identify vague business problems where a data science approach is appropriate. Bring structure to the problem, apply the right problem-solving solutions, and recommend actions that improve our product and user experience. Lead and grow a team that delivers quality work with a large impact. Create a team foundation with high morale and grow our future data science leaders. Foster a culture of continuous learning. Proactively identify new data sources, tools, and methodologies to enhance our problem-solving capabilities and drive innovation.Serve as a key conduit of understanding the relationship between teams, and elucidate and quantify tradeoffs between competing goals.Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
      "requirements": [
        "Bachelor's degree in Statistics, Mathematics, Data Science",
        "Master's degree in Statistics, Mathematics, Data Science",
        "experience with a Master's degree",
        "Minimum qualifications:Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field",
        "10 years of experience using analytics to solve product or business problems, performing statistical analysis, and coding (e",
        ", Python, R, SQL), or 8 years of experience with a Master's degree",
        "3 years of experience as a people manager within a technical leadership role",
        "Preferred qualifications:Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field"
      ],
      "job_type": "Full-time",
      "skills": [
        "Less",
        "Go",
        "Sql",
        "R",
        "Data Science",
        "Python"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-manager-product-photos-and-g1-at-google-4297872542?position=7&pageNum=7&refId=HDSHoPm%2Bx%2BufnSMxJeqFEA%3D%3D&trackingId=MdhuFJuEFafin7w%2FdeHs8A%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data Scientist Product, Google One, Photos",
      "company": "Google",
      "location": "Bengaluru, Karnataka, India",
      "description": "Minimum qualifications:Bachelor's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field, or equivalent practical experience.5 years of experience with analysis applications (e.g., extracting insights, performing statistical analysis, or solving business problems), and coding (e.g., Python, R, SQL) or 2 years of experience with a Master's degree.Preferred qualifications:Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field.Experience in partnering on cross-functional projects or teams with technical and non-technical stakeholders. Excellent problem solving, analysis skills and business judgment, with the ability to identify business problems and provide investigative solutions.Excellent project management and planning skills with the ability to manage multiple priorities at the same time.About the jobHelp serve Google's worldwide user base of more than a billion people. Data Scientists provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization. As a data-loving member of the team, you serve as an analytics expert for your partners, using numbers to help them make better decisions. You will weave stories with meaningful insight from data. You'll make critical recommendations for your fellow Googlers in Engineering and Product Management. You relish tallying up the numbers one minute and communicating your findings to a team leader the next.Google Photos is a photo sharing and storage service developed by Google. Photos is one of the most sought after products at Google and is looking for both client-side (web and mobile), with server-side (search, storage, serving) and machine intelligence (learning, computer vision) Software Engineers. We are dedicated to making Google experiences centered around the user.ResponsibilitiesPerform analysis by utilizing related tools (e.g., SQL, R, Python). Use technical knowledge and custom data infrastructure or existing data models.Build and prototype analysis and business cases to provide insights.Support the Google one product roadmap. Partner with Product Manager (PM), Engineers and other folks in Analytics to understand the profile of Google One business. Use data to evaluate how the business is evolving and drive decisions based on the insights.Identify business problems and come up with investigative solutions that improve the product and user experience, spanning Google One and its cross-product areas. Help the cross-functional business partner.Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
      "requirements": [
        "Bachelor's degree in Statistics, Mathematics, Data Science",
        "Master's degree in Statistics, Mathematics, Data Science",
        "experience with analysis applications (e",
        "experience with a Master's degree",
        "5 years of experience with analysis applications (e",
        ", Python, R, SQL) or 2 years of experience with a Master's degree",
        "Preferred qualifications:Master's degree in Statistics, Mathematics, Data Science, Engineering, Physics, Economics, or a related quantitative field"
      ],
      "job_type": "Full-time",
      "skills": [
        "Less",
        "Go",
        "Sql",
        "R",
        "Data Science",
        "Python"
      ],
      "posted_date": "2025-09-09",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-product-google-one-photos-at-google-4297867972?position=3&pageNum=10&refId=0Wqr6dkCb%2BHZGronwZUXMw%3D%3D&trackingId=f6rrK3SmkTo1x7LKnNaJTQ%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Junior Data Scientist",
      "company": "Cardinal Health",
      "location": "Bengaluru East, Karnataka, India",
      "description": "What Data Science Contributes To Cardinal HealthThe Data & Analytics Function oversees the analytics life-cycle in order to identify, analyze and present relevant insights that drive business decisions and anticipate opportunities to achieve a competitive advantage. This function manages analytic data platforms, the access, design and implementation of reporting/business intelligence solutions, and the application of advanced quantitative modeling.Data Science applies base, scientific methodologies from various disciplines, techniques and tools that extracts knowledge and insight from data to solve complex business problems on large data sets, integrating multiple systems.Qualifications2-4 years of experience, preferredBachelor's degree in related field, or equivalent work experience, preferredTechnical support and enhancements for GenAI pipelines with RAGAssist with prompt engineering to improve performanceMonitor system performance, logs, retrieval quality and prompt-effectivenessProvide on-call support during incidentsWhat is expected of you and others at this levelApplies working knowledge in the application of concepts, principles and technical capabilities to perform varied tasksWorks on projects of moderate scope and complexityIdentifies possible solutions to a variety of technical problems and takes action to resolveApplies judgment within defined parametersReceives general guidance and may receive more detailed instruction on new projectsWork reviewed for sound reasoning and accuracyCandidates who are back-to-work, people with disabilities, without a college degree, and Veterans are encouraged to apply.Cardinal Health supports an inclusive workplace that values diversity of thought, experience and background. We celebrate the power of our differences to create better solutions for our customers by ensuring employees can be their authentic selves each day. Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law.",
      "requirements": [
        "Bachelor's degree in related field, or equivalent work exp",
        "degree, and Veterans are encouraged to apply",
        "work, people with disabilities, without a college degree, and Veterans are encouraged to apply"
      ],
      "job_type": "Full-time",
      "skills": [
        "Data Science",
        "Ai",
        "Express",
        "R"
      ],
      "posted_date": "2025-09-03",
      "job_url": "https://in.linkedin.com/jobs/view/junior-data-scientist-at-cardinal-health-4284045781?position=4&pageNum=10&refId=0Wqr6dkCb%2BHZGronwZUXMw%3D%3D&trackingId=D4rIZXIMhe4n9C1rMhvOJg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Entry Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Machine Learning Engineer",
      "company": "Egen",
      "location": "Hyderabad, Telangana, India",
      "description": "We are seeking a highly motivated and experienced ML Engineer/Data Scientist to join our growing ML/GenAI team.You will play a key role in designing, developing and productionalizing ML applications by evaluating models, training and/or fine tuning them. You will play a crucial role in developing Gen AI based solutions for our customers. As a senior member of the team, you will take ownership of projects, collaborating with engineers and stakeholders to ensure successful project delivery.What we're looking for:At least 3 years of experience in designing & building AI applications for customer and deploying them into productionAt least 5 years of Software engineering experience in building Secure, scalable and performant applications for customers.Experience with Document extraction using AI, Conversational AI, Vision AI, NLP or Gen AI.Design, develop, and operationalize existing ML models by fine tuning, personalizing it.Evaluate machine learning models and perform necessary tuning.Develop prompts that instruct LLM to generate relevant and accurate responses.Collaborate with data scientists and engineers to analyze and preprocess datasets for prompt development, including data cleaning, transformation, and augmentation.Conduct thorough analysis to evaluate LLM responses, iteratively modify prompts to improve LLM performance.Hands on customer experience with RAG solution or fine tuning of LLM model.Build and deploy scalable machine learning pipelines on GCP or any equivalent cloud platform involving data warehouses, machine learning platforms, dashboards or CRM tools.Experience working with the end-to-end steps involving but not limited to data cleaning, exploratory data analysis, dealing outliers, handling imbalances, analyzing data distributions (univariate, bivariate, multivariate), transforming numerical and categorical data into features, feature selection, model selection, model training and deployment.Proven experience building and deploying machine learning models in production environments for real life applicationsGood understanding of natural language processing, computer vision or other deep learning techniques.Expertise in Python, Numpy, Pandas and various ML libraries (e.g., XGboost, TensorFlow, PyTorch, Scikit-learn, LangChain).Familiarity with Google Cloud or any other Cloud Platform and its machine learning services.Excellent communication, collaboration, and problem-solving skills.Good to Have Google Cloud Certified Professional Machine Learning or TensorFlow Certified Developer certifications or equivalent.Experience of working with one or more public cloud platforms - namely GCP, AWS or Azure.Experience with Amazon Lex or Google DialogFlow CX or Microsoft Copilot studio for CCAI Agent workflows Experience with AutoML and vision techniques.Master’s degree in statistics, machine learning or related fields.",
      "requirements": [
        "At least 3 years of experience",
        "Master’s degree in statistics, machine learning or relat",
        "Experience with Document extraction using AI, Conversational AI, Vision AI, NLP or Gen AI",
        "experience with RAG solution or fine tuning of LLM model",
        "Experience with Amazon Lex or Google DialogFlow CX or Microsoft Copilot studio for CCAI Agent w",
        "Experience with AutoML and vision techniques",
        "Good to Have Google Cloud Certified Professional Machine Learning or TensorFlow Certified Developer certifications or equivalent",
        "Master’s degree in statistics, machine learning or related fields"
      ],
      "job_type": "Full-time",
      "skills": [
        "Ai",
        "Aws",
        "Scikit-Learn",
        "Scala",
        "Go",
        "Deep Learning",
        "Pandas",
        "Machine Learning",
        "Pytorch",
        "Numpy",
        "R",
        "Gcp"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-egen-4299164417?position=5&pageNum=10&refId=0Wqr6dkCb%2BHZGronwZUXMw%3D%3D&trackingId=HgxjBpf5DsaLgGkoNOVGEw%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI / ML Engineer",
      "company": "Accenture services Pvt Ltd",
      "location": "Bengaluru, Karnataka, India",
      "description": "Project Role : AI / ML EngineerProject Role Description : Develops applications and systems that utilize AI tools, Cloud AI services, with proper cloud or on-prem application pipeline with production ready quality. Be able to apply GenAI models as part of the solution. Could also include but not limited to deep learning, neural networks, chatbots, image processing.Must have skills : Virtual AgentsGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an AI / ML Engineer, you will engage in the development of applications and systems that leverage artificial intelligence tools and cloud AI services. Your typical day will involve designing and implementing production-ready solutions, ensuring that they meet quality standards. You will work with various AI models, including generative AI, deep learning, and neural networks, while also exploring innovative applications such as chatbots and image processing. Collaboration with cross-functional teams will be essential to integrate these advanced technologies into effective solutions that address real-world challenges. Roles & Responsibilities: - Expected to be an SME, collaborate and manage the team to perform. - Responsible for team decisions. - Engage with multiple teams and contribute on key decisions. - Provide solutions to problems for their immediate team and across multiple teams. - Facilitate knowledge sharing and mentoring within the team to enhance overall performance. - Continuously evaluate and improve existing AI models and systems to ensure optimal performance. Professional & Technical Skills: - Must To Have Skills: Proficiency in Virtual Agents. - Strong understanding of AI frameworks and libraries such as TensorFlow and PyTorch. - Experience with cloud platforms and services, including AWS, Azure, or Google Cloud. - Familiarity with natural language processing techniques and tools. - Ability to design and implement scalable AI solutions that meet business needs. Additional Information: - The candidate should have minimum 5 years of experience in Virtual Agents. - This position is based at our Bengaluru office. - A 15 years full time education is required.",
      "requirements": [
        "Must have skills : Virtual AgentsGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducationa",
        "essential to integrate these advanced technologies into effective solutions that address real-world challenges",
        "minimum 5 years of experience",
        "Proficiency in Virtual Agents",
        "Experience with cloud platforms and services, including AWS, Azure, or Google Cloud",
        "Strong understanding of AI frameworks and libraries such as TensorFlow and PyTorch",
        "functional teams will be essential to integrate these advanced technologies into effective solutions that address real",
        "The candidate should have minimum 5 years of experience in Virtual Agents"
      ],
      "job_type": "Full-time",
      "skills": [
        "Aws",
        "Artificial Intelligence",
        "Scala",
        "Go",
        "Deep Learning",
        "Pytorch",
        "R",
        "Ai",
        "Azure",
        "Tensorflow"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-accenture-services-pvt-ltd-4299863662?position=3&pageNum=12&refId=nd3ZtltcoRqDYLUUUxyV9A%3D%3D&trackingId=WlQdSnpfPMYDKwHOhkwgSg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data Scientist",
      "company": "Infosys",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Master's degree in Computer Science, Statistics, Mathematics, or a related field. 7+ years of experience in data science and machine learning with a strong focus on model development and deployment. Expert-level knowledge of statistics, including probability theory, hypothesis testing, and statistical inference. In-depth knowledge of machine learning algorithms, including linear regression, logistic regression, decision trees, random forests, xgboost, and ensemble learning.Evaluate the performance of machine learning models and refine them to improve accuracy andgeneralizability. Communicate data insights to stakeholders in a clear and concise manner, using data visualization techniques and storytelling. collaborate with data engineers, software developers, and business stakeholders to integrate data science solutions into products and services. Stay up-to-date with the latest trends and developments in data science, machine learning, and artificial intelligence. Experience with Natural Language Processing (NLP) and Computer Vision (CV) techniques. Knowledge of DevOps methodologies and practices for continuous integration/continuous delivery (CI/CD). Experience with data warehousing and data lakes solutions like BigQuery or Snowflake. Familiarity with real-time data processing and streaming analytics. Passion for learning and staying at the forefront of data science and machine learning advancements.",
      "requirements": [
        "Master's degree in Computer Science, Statistics, Mathema",
        "knowledge of statistics, including probability theory, hypothesis testing, and statistical i",
        "knowledge of machine learning algorithms, including linear regression, logistic regression,",
        "Experience with Natural Language Processing (NLP) and Computer Vision (CV) techniques",
        "Knowledge of DevOps methodologies and practices for continuous integration/continuous delive",
        "Experience with data warehousing and data lakes solutions like BigQuery or Snowflake",
        "Master's degree in Computer Science, Statistics, Mathematics, or a related field",
        "7+ years of experience in data science and machine learning with a strong focus on model development and deployment"
      ],
      "job_type": "Full-time",
      "skills": [
        "Artificial Intelligence",
        "Ci/Cd",
        "Go",
        "Machine Learning",
        "R",
        "Data Science"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-at-infosys-4275425149?position=8&pageNum=12&refId=nd3ZtltcoRqDYLUUUxyV9A%3D%3D&trackingId=QcmNu36JKf2yZTCFGBgmcA%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Machine Learning Engineer (T25)",
      "company": "eBay",
      "location": "Bengaluru, Karnataka, India",
      "description": "At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.Our customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.Join a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.Machine Learning Engineer (T25), Product KnowledgeDo you love Big Data? Deploying Machine Learning models? Challenging optimization problems? Knowledgeable, collaborative co-workers? Come work at eBay and help us redefine global, online commerce!Who Are We?The Product Knowledge team is at the epicenter of eBay’s Tech-driven, Customer-centric overhaul. Our team is entrusted with creating and using eBay’s Product Knowledge - a vast Big Data system which is built up of listings, transactions, products, knowledge graphs, and more. Our team has a mix of highly proficient people from multiple fields such as Machine Learning, Data Science, Software Engineering, Operations, and Big Data Analytics. We have a strong culture of collaboration, and plenty of opportunity to learn, make an impact, and grow!What Will You DoWe Are Looking For Exceptional Engineers, Who Take Pride In Creating Simple Solutions To Apparently-complex Problems. Our Engineering Tasks Typically Involve At Least One Of The FollowingBuilding a pipeline that processes up to billions of items, frequently employing ML models on these datasetsCreating services that provide Search or other Information Retrieval capabilities at low latency on datasets of hundreds of millions of itemsCrafting sound API design and driving integration between our Data layers and Customer-facing applications and componentsDesigning and running A/B tests in Production experiences in order to vet and measure the impact of any new or improved functionalityIf you love a good challenge, and are good at handling complexity - we’d love to hear from you!eBay is an amazing company to work for. Being on the team, you can expect to benefit from:A competitive salary - including stock grants and a yearly bonusA healthy work culture that promotes business impact and at the same time highly values your personal well-beingBeing part of a force for good in this world - eBay truly cares about its employees, its customers, and the world’s population, and takes every opportunity to make this clearly apparentJob ResponsibilitiesDesign, deliver, and maintain significant features in data pipelines, ML processing, and / or service infrastructureOptimize software performance to achieve the required throughput and / or latencyWork with your manager, peers, and Product Managers to scope projects and featuresCome up with a sound technical strategy, taking into consideration the project goals, timelines, and expected impactTake point on some cross-team efforts, taking ownership of a business problem and ensuring the different teams are in sync and working towards a coherent technical solutionTake active part in knowledge sharing across the organization - both teaching and learning from othersMinimum QualificationsPassion and commitment for technical excellence B.Sc. or M.Sc. in Computer Science or an equivalent professional experience 2+ years of software design and development experience, tackling non-trivial problems in backend services and / or data pipelinesA solid foundation in Data Structures, Algorithms, Object-Oriented Programming, Software Design, and core Statistics knowledgeExperience in production-grade coding in Java, and Python/Scala Experience in the close examination of data and computation of statistics Experience in using and operating Big Data processing pipelines, such as: Hadoop and SparkGood verbal and written communication and collaboration skillsPlease see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the eBay Careers website or apply for a job with eBay.eBay is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you have a need that requires accommodation, please contact us at talent@ebay.com. We will make every effort to respond to your request for accommodation as soon as possible. View our accessibility statement to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities.The eBay Jobs website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.",
      "requirements": [
        "required throughput and / or latencyWork with your manager, peers, and Product Managers to scope projects and",
        "both teaching and learning from othersMinimum QualificationsPassion and commitment for technical excellence B"
      ],
      "job_type": "Full-time",
      "skills": [
        "Scala",
        "Go",
        "Machine Learning",
        "Hadoop",
        "Spark",
        "R",
        "Rust",
        "Data Science",
        "Ai",
        "Git",
        "Python",
        "Java"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/machine-learning-engineer-t25-at-ebay-4259876968?position=3&pageNum=15&refId=5w%2Bv7iDUHEXK61jAdsJz0g%3D%3D&trackingId=LO%2Fv6PK0EgwaQtcUFHo8Cg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data Scientist- Associate 2",
      "company": "PwC Acceleration Center India",
      "location": "Bengaluru, Karnataka, India",
      "description": "At PwC, our people in data and analytics engineering focus on leveraging advanced technologies and techniques to design and develop robust data solutions for clients. They play a crucial role in transforming raw data into actionable insights, enabling informed decision-making and driving business growth. Those in data science and machine learning engineering at PwC will focus on leveraging advanced analytics and machine learning techniques to extract insights from large datasets and drive data-driven decision making. You will work on developing predictive models, conducting statistical analysis, and creating data visualisations to solve complex business problems.The OpportunityWhen you join PwC Acceleration Centers (ACs), you step into a pivotal role focused on actively supporting various Acceleration Center services, from Advisory to Assurance, Tax and Business Services. In our innovative hubs, you’ll engage in challenging projects and provide distinctive services to support client engagements through enhanced quality and innovation. You’ll also participate in dynamic and digitally enabled training that is designed to grow your technical and professional skills.As part of the AI Engineering team you will design and deliver scalable AI applications while conducting applied research in Generative AI and深度学习. As an Associate you will focus on learning and contributing to projects, developing your skills and knowledge to deliver quality work while building meaningful client connections and navigating complex situations. This role offers the chance to work with advanced technologies and be part of a impactful team dedicated to driving enterprise innovation.Responsibilities Design and implement scalable AI applications Conduct applied research in Generative AI and advanced learning Collaborate with team members to enhance project outcomes Develop technical skills to support project tasks Build and maintain relationships with clients Analyze data to derive insights and inform decisions Adapt to evolving technologies and methodologies Contribute to a significant team focused on innovationWhat You Must Have Master's Degree in Computer Science, Engineering, Econometrics, Statistics, Business Analytics, Informatics 2 years of experience Oral and written proficiency in English requiredWhat Sets You Apart Bachelor's Degree in Computer Science, Engineering preferred Proficiency in Python and data science libraries Experience with Generative AI and prompt engineering Knowledge of NLP techniques and transformer architectures Familiarity with cloud platforms, preferably Azure Understanding of production-level AI systems Experience with Docker and containerized deployments Desire to innovate and automate processes A mindset of continuous learning and technical curiosity",
      "requirements": [
        "Must Have Master's Degree in Computer Science, Engineering, Econometrics, Statistics, Business Analytics, Info",
        "Master's Degree in Computer Science, Engineering, Econom",
        "Bachelor's Degree in Computer Science, Engineering preferr",
        "proficiency in English requiredWhat Sets You Apart Bachelor's Degree in Computer Science, Engi",
        "Proficiency in Python and data science libraries Experience with Generative AI and prompt engi",
        "Knowledge of NLP techniques and transformer architectures Familiarity with cloud platforms,",
        "Experience with Docker and containerized deployments Desire to innovate and automate processes"
      ],
      "job_type": "Full-time",
      "skills": [
        "Ai",
        "Scala",
        "Machine Learning",
        "Ios",
        "R",
        "Data Science",
        "Docker",
        "Azure",
        "Python",
        "Git"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-associate-2-at-pwc-acceleration-center-india-4297493005?position=5&pageNum=15&refId=5w%2Bv7iDUHEXK61jAdsJz0g%3D%3D&trackingId=%2FtJCLSUoyGN825EXKVymog%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Entry Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Machine Learning Engineer",
      "company": "Adobe",
      "location": "Bengaluru East, Karnataka, India",
      "description": "Our CompanyChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!Adobe Advertising CloudAdobe Advertising is a combination of a ‘Demand Side Platform (DSP)’ and a ‘Spend Optimizer’ that helps customers plan, buy, measure, and optimize their digital media (across CTV, Online Video, Display, Search, Social, and Retail Media Networks). We help the largest global advertisers maximize the impact of their paid media budgets by delivering connected and personalized experiences to their consumers.The OpportunityThis opportunity is with the Spend Optimizer group. In collaboration with a team of highly motivated data scientists and engineers, you will apply reinforcement learning, time series analysis, bayesian modeling, Gen AI frameworks to optimize ad spends and drive the best user experiences.What You'll DoTechnically lead and guide team of skilled machine learning engineers to design and implement ML algorithms/modelsCollaborate with multi-functional teams to determine technical requirementsDevelop and deploy scalable machine learning solutions that optimize Adobe’s products and services, deliver value to clients and drive customer adoptionDrive innovation through research and experimentation, encouraging an environment where new ideas can thriveMonitor and evaluate the performance of ML models, making vital adjustments to compete at the highest levelWhat You Need To SucceedOutstanding knowledge of machine learning frameworks and tools such as PyTorch, Tensorflow, Scikit-learn, with strong programming skills in PythonSolid understanding of core machine learning and statistics, including Bayesian Modeling, Time Series Analysis, Reinforcement Learning, and OptimizationExperience in developing, deploying and maintaining ML models in a production environmentAbility to thrive in a collaborative, inclusive, and diverse workplace, embracing different perspectives and ideasIdeal Candidate Profile:About 10 years of experience in an applied Machine Learning setting, delivering cloud-scale, data-driven products, and servicesPhD or Master’s in Computer Science/ Applied Math/Statistics/ related field. Experience and domain expertise in Digital ad technologies is desirable. Comfort with ambiguity, adaptability to evolving priorities, and an ability to influence technical and non-technical collaboratorsA very strong problem solving and execution ability, ability to innovate, and focus on delivering value to Adobe customers, can compensate for any of the above requirements. Adobe is proud to be an Equal Employment Opportunity employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.",
      "requirements": [
        "PhD or Master’s in Computer Science/ Applied Math/Sta",
        "knowledge of machine learning frameworks and tools such as PyTorch, Tensorflow, Scikit-learn",
        "Solid understanding of core machine learning and statistics, including Bayesian Modeling, Time Seri"
      ],
      "job_type": "Full-time",
      "skills": [
        "Scikit-Learn",
        "Scala",
        "Go",
        "Express",
        "Machine Learning",
        "Pytorch",
        "R",
        "Ai",
        "Git",
        "Python",
        "Tensorflow"
      ],
      "posted_date": "2025-09-11",
      "job_url": "https://in.linkedin.com/jobs/view/machine-learning-engineer-at-adobe-4272839948?position=1&pageNum=17&refId=OKfJ2Nd%2FWwRmtbPYoPEuwA%3D%3D&trackingId=UraYvMaPa8AQuMDEyBmb6w%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI / ML Engineer",
      "company": "Accenture services Pvt Ltd",
      "location": "Pune, Maharashtra, India",
      "description": "Project Role : AI / ML EngineerProject Role Description : Develops applications and systems that utilize AI tools, Cloud AI services, with proper cloud or on-prem application pipeline with production ready quality. Be able to apply GenAI models as part of the solution. Could also include but not limited to deep learning, neural networks, chatbots, image processing.Must have skills : Machine LearningGood to have skills : NAMinimum 15 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an AI / ML Engineer, you will develop applications and systems that leverage artificial intelligence tools and cloud AI services. Your typical day will involve designing and implementing production-ready solutions, ensuring that they meet quality standards. You will work on various projects that may include deep learning, neural networks, chatbots, and image processing, collaborating with cross-functional teams to deliver innovative solutions that enhance operational efficiency and user experience. Roles & Responsibilities: - Expected to be a Subject Matter Expert with deep knowledge and experience. - Should have influencing and advisory skills. - Responsible for team decisions. - Engage with multiple teams and contribute on key decisions. - Expected to provide solutions to problems that apply across multiple teams. - Facilitate knowledge sharing sessions to enhance team capabilities and foster a culture of continuous learning. - Evaluate and recommend new technologies and tools that can improve the efficiency and effectiveness of AI solutions. Professional & Technical Skills: - Must To Have Skills: Proficiency in Machine Learning. - Strong understanding of various machine learning algorithms and their applications. - Experience with cloud-based AI services and deployment strategies. - Familiarity with programming languages such as Python or R for data analysis and model development. - Knowledge of data preprocessing techniques and data pipeline construction. Additional Information: - The candidate should have minimum 15 years of experience in Machine Learning. - This position is based in Pune. - A 15 years full time education is required.",
      "requirements": [
        "Must have skills : Machine LearningGood to have skills : NAMinimum 15 Year(s) Of Experience Is RequiredEducati",
        "minimum 15 years of experience",
        "Proficiency in Machine Learning",
        "Experience with cloud-based AI services and deployment strategies",
        "Knowledge of data preprocessing techniques and data pipeline construction",
        "Strong understanding of various machine learning algorithms and their applications",
        "The candidate should have minimum 15 years of experience in Machine Learning",
        "A 15 years full time education is required"
      ],
      "job_type": "Full-time",
      "skills": [
        "Artificial Intelligence",
        "Go",
        "Deep Learning",
        "Machine Learning",
        "R",
        "Ai",
        "Python"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-accenture-services-pvt-ltd-4299871589?position=7&pageNum=17&refId=OKfJ2Nd%2FWwRmtbPYoPEuwA%3D%3D&trackingId=3T2HVhaam0FHfWVWBFl5Ng%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI / ML Engineer",
      "company": "Accenture services Pvt Ltd",
      "location": "Bengaluru, Karnataka, India",
      "description": "Project Role : AI / ML EngineerProject Role Description : Develops applications and systems that utilize AI tools, Cloud AI services, with proper cloud or on-prem application pipeline with production ready quality. Be able to apply GenAI models as part of the solution. Could also include but not limited to deep learning, neural networks, chatbots, image processing.Must have skills : Virtual AgentsGood to have skills : NAMinimum 5 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an AI / ML Engineer, you will engage in the development of applications and systems that leverage artificial intelligence tools and cloud AI services. Your typical day will involve designing and implementing production-ready solutions, ensuring that they meet quality standards. You will work with various AI models, including generative AI, deep learning, and neural networks, while also exploring innovative applications such as chatbots and image processing. Collaboration with cross-functional teams will be essential to integrate these advanced technologies into effective solutions that address real-world challenges. Roles & Responsibilities: - Expected to be an SME, collaborate and manage the team to perform. - Responsible for team decisions. - Engage with multiple teams and contribute on key decisions. - Provide solutions to problems for their immediate team and across multiple teams. - Facilitate knowledge sharing and mentoring within the team to enhance overall performance. - Continuously evaluate and improve existing AI models and systems to ensure optimal performance. Professional & Technical Skills: - Must To Have Skills: Proficiency in Virtual Agents. - Strong understanding of AI frameworks and libraries such as TensorFlow and PyTorch. - Experience with cloud platforms and services, including AWS, Azure, or Google Cloud. - Familiarity with natural language processing techniques and tools. - Ability to design and implement scalable AI solutions that meet business needs. Additional Information: - The candidate should have minimum 5 years of experience in Virtual Agents. - This position is based at our Bengaluru office. - A 15 years full time education is required.",
      "requirements": [
        "Must have skills : Virtual AgentsGood to have skills : NAMinimum 5 Year(s) Of Experience Is RequiredEducationa",
        "essential to integrate these advanced technologies into effective solutions that address real-world challenges",
        "minimum 5 years of experience",
        "Proficiency in Virtual Agents",
        "Experience with cloud platforms and services, including AWS, Azure, or Google Cloud",
        "Strong understanding of AI frameworks and libraries such as TensorFlow and PyTorch",
        "functional teams will be essential to integrate these advanced technologies into effective solutions that address real",
        "The candidate should have minimum 5 years of experience in Virtual Agents"
      ],
      "job_type": "Full-time",
      "skills": [
        "Aws",
        "Artificial Intelligence",
        "Scala",
        "Go",
        "Deep Learning",
        "Pytorch",
        "R",
        "Ai",
        "Azure",
        "Tensorflow"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-accenture-services-pvt-ltd-4299866637?position=9&pageNum=17&refId=OKfJ2Nd%2FWwRmtbPYoPEuwA%3D%3D&trackingId=A3pdXWVShRQ9Op%2Ft8FzwoA%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "AI / ML Engineer",
      "company": "Accenture services Pvt Ltd",
      "location": "Bengaluru, Karnataka, India",
      "description": "Project Role : AI / ML EngineerProject Role Description : Develops applications and systems that utilize AI tools, Cloud AI services, with proper cloud or on-prem application pipeline with production ready quality. Be able to apply GenAI models as part of the solution. Could also include but not limited to deep learning, neural networks, chatbots, image processing.Must have skills : Generative AIGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducational Qualification : 15 years full time educationSummary: As an AI / ML Engineer, you will engage in the development of applications and systems that leverage artificial intelligence tools and cloud AI services. Your typical day will involve designing and implementing production-ready solutions, ensuring that they meet quality standards. You will work with various AI models, including generative AI, deep learning, and neural networks, while collaborating with cross-functional teams to deliver innovative solutions that address complex challenges in the field of artificial intelligence. Roles & Responsibilities: - Expected to perform independently and become an SME. - Required active participation/contribution in team discussions. - Contribute in providing solutions to work related problems. - Collaborate with team members to design and implement AI-driven applications. - Continuously evaluate and improve existing AI models and systems. Professional & Technical Skills: - Must To Have Skills: Proficiency in Generative AI. - Good To Have Skills: Experience with deep learning frameworks such as TensorFlow or PyTorch. - Strong understanding of cloud computing services and deployment strategies. - Experience in developing and deploying chatbots and image processing applications. - Familiarity with data preprocessing and feature engineering techniques. Additional Information: - The candidate should have minimum 3 years of experience in Generative AI. - This position is based at our Bengaluru office. - A 15 years full time education is required.",
      "requirements": [
        "Must have skills : Generative AIGood to have skills : NAMinimum 3 Year(s) Of Experience Is RequiredEducational",
        "Required active participation/contribution in team discussions",
        "minimum 3 years of experience",
        "Proficiency in Generative AI",
        "Experience with deep learning frameworks such as TensorFlow or PyTorch",
        "Strong understanding of cloud computing services and deployment strategies",
        "The candidate should have minimum 3 years of experience in Generative AI",
        "A 15 years full time education is required"
      ],
      "job_type": "Full-time",
      "skills": [
        "Artificial Intelligence",
        "Go",
        "Deep Learning",
        "Pytorch",
        "R",
        "Ai",
        "Tensorflow"
      ],
      "posted_date": "2025-09-13",
      "job_url": "https://in.linkedin.com/jobs/view/ai-ml-engineer-at-accenture-services-pvt-ltd-4299872518?position=4&pageNum=20&refId=aCCt44jNi4rJuw4Ze6dzoQ%3D%3D&trackingId=E8XX5fMdoZp%2BYf%2FMk90pwg%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    },
    {
      "title": "Data Scientist",
      "company": "Capgemini",
      "location": "Bengaluru, Karnataka, India",
      "description": "At Capgemini Engineering, the world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.Your RoleGen AI ,Computer vision, Cloud exp , AzureNeed to understand how the products are developed and even more important, as big data touches the privacy of consumers, they need to have a set of ethicalNeed to have a natural desire to go beneath the surface of a problem. Confident and self-secure as they more often than not will have to deal with situations where there is a lot of unknown.Good knowledge & experience in Artificial Neural Network ( ANN ), AI conversational Chatbot & Needs to be able to write the required Algorithm and coding programming. Preferably in different programming languages such as Python, Tensor Flow, Keras, AWS (ML and DL), Numpy, and Pytorch.Works in the area of Software Engineering, which encompasses the development, maintenance and optimization of software solutions/applications.1. Applies scientific methods to analyse and solve software engineering problems.2. He/she is responsible for the development and application of software engineering practice and knowledge, in research, design, development and maintenance.3. His/her work requires the exercise of original thought and judgement and the ability to supervise the technical and administrative work of other software engineers.4. The software engineer builds skills and expertise of his/her software engineering discipline to reach standard software engineer skills expectations for the applicable role, as defined in Professional Communities.5. The software engineer collaborates and acts as team player with other software engineers and stakeholders.Your ProfileNatural Language Processing, Machine learning, Conceptual modeling, Statistical analysis, Predictive Modeling, and Hypothesis testing.Data scientists should have at least some of the following capabilities : Cleaning data, formatting data, Having the ability to query databases & perform statistical analysis, building AI Data Modelling, validating the AI Model, and deployment. Being able to develop or program databases.Having a good understanding of design & architecture principles.What Will You Love Working At CapgeminiEvery Monday, kick off the week with a musical performance by our in-house band - The Rubber Band. Also get to participate in internal sports events, yoga challenges, or marathons.At Capgemini, you can work on cutting-edge projects in tech and engineering with industry leaders or create solutions to overcome societal and environmental challenges. Employees rate the work culture highly (4.1/5), appreciating the collaborative environment and supportive teams Hybrid work models and flexible timings are common, with many roles offering remote or partially remote options Capgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem.",
      "requirements": [
        "required Algorithm and coding programming"
      ],
      "job_type": "Full-time",
      "skills": [
        "Aws",
        "Go",
        "Machine Learning",
        "Pytorch",
        "Numpy",
        "R",
        "Rust",
        "Keras",
        "Ai",
        "Azure",
        "Python",
        "Git"
      ],
      "posted_date": "2025-09-12",
      "job_url": "https://in.linkedin.com/jobs/view/data-scientist-at-capgemini-4298733263?position=7&pageNum=20&refId=aCCt44jNi4rJuw4Ze6dzoQ%3D%3D&trackingId=4NppHS05s2ViG%2Fu%2B%2BbQGig%3D%3D",
      "salary": "",
      "category": "Data Science & Analytics",
      "is_trusted_company": true,
      "experience_level": "Mid Level",
      "employment_type": "Full-time"
    }
  ]
}